arm = ["ա","Ա","բ","Բ","գ","Գ","դ","Դ","ե","Ե","զ","Զ","է","Է","ը7", "Ը","թ","Թ","ժ","Ժ","ի","Ի","լ","Լ","խ","Խ","ծ","Ծ","կ","Կ","հ","Հ","ձ","Ձ","ղ","Ղ","ճ","Ճ","մ","Մ","յ","Յ","ն","Ն","շ","Շ","ո","Ո","չ","Չ","պ","Պ","ջ","Ջ","ռ","Ռ","ս","Ս","վ","Վ","տ","Տ","ր","Ր","ց","Ց","ւ","Ւ","փ","Փ","ք","Ք","օ","Օ","ֆ","Ֆ","ու", "ու","և",  "և"]

aze = ["Ç", "ç", "Ə", "ə", "Ğ", "ğ", "I", "ı", "İ", "i", "Ö", "ö", "Ş", "ş", "Ü", "ü", ]

rus = ["А", "а", "Б", "б", "В", "в", "Г", "г", "Д", "д", "Е", "е", "Ё", "ё", "Ж", "ж", "З", "з", "И", "и", "Й", "й", "К", "к", "Л", "л", "М", "м", "Н", "н", "О", "о", "П", "п", "Р", "р", "С", "с", "Т", "т", "У", "у", "Ф", "ф", "Х", "х", "Ц", "ц", "Ч", "ч", "Ш", "ш", "Щ", "щ", "Ъ", "ъ", "Ы", "ы", "Ь", "ь", "Э", "э", "Ю", "ю", "Я", "я"]

geo = ["ა","ბ","გ","დ","ე","ვ","ზ","თ","ი","კ","ლ","მ","ნ","ო","პ","ჟ","რ","ს","ტ","უ","ფ","ქ","ღ","ყ","შ","ჩ","ც","ძ","წ","ჭ","ხ","ჯ","ჰ"]

def detect_multi_lang(text):
    ret = []
    if any(letter in text for letter in aze):
        ret.append('az')
    if any(letter in text for letter in geo)::
        ret.append('ka')
    if any(letter in text for letter in arm)::
        ret.append('ar')
    if any(letter in text for letter in rus)::
        ret.append('ru')
    return ret
